leks = {'if':['Ключевое слово', 'Y1'],
        'else':['Ключевое слово', 'Y2'],
        'for':['Ключевое слово', 'C1'],
        'while':['Ключевое слово', 'C2'],
        'pass':['Ключевое слово', 'XYZ'],
        'break':['Ключевое слово', 'XYZ1'],
        'print':['Ключевое слово', 'P'],
        'and':['Логическая операция', 'L1'],
        'or':['Логическая операция', 'L2'],
        '+':['Знак арифмитической операции', 'A1'],
        '-':['Знак арифмитической операции', 'A2'],
        '==':['Логическая операция', 'L3'],
        '=':['Знак присваивания', 'R'],
        '*':['Знак арифмитической операции', 'A3'],
        '**':['Знак арифмитической операции', 'A4'],
        '/':['Знак арифмитической операции', 'A5'],
        '//':['Знак арифмитической операции', 'A6'],
        '%':['Знак арифмитической операции', 'A7'],
        '👀':['Комментарий', 'K']}

kills = ['\n', ' ', ':', '(', ')', '{', '}', ']', '[']

before = ['L1', 'L2', 'L3', 'R', 'A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7']